export const Noticedata = [
    {
        id: 1,
        title: '리디셀렉트 가격 인상 안내',
        info: "웹툰, 웹소설을 포함하여 각종 서적을 전자책으로 볼 수 있는 리디셀렉트를 이용해 주셔서 감사해요. 아쉽지만 제휴사 사정으로 5월 2일부터 구독료가 2,000원 오를 예정이에요. 5월 2일(화)부터 신규 가입하는 가입자분들은 3,900원으로 리디셀렉트를 이용하실 수 있습니다. 2023년 5월 2일(화) 이전부터 구독하던 고객님은 5월 한 달만 오르기 전 가격인 1,900 원으로 이용할 수 있고, 6월 1일부터 3,900원으로 오를 예정입니다."
    },
    {
        id: 2,
        title: '클래스101+ 월 구독권 가격 인상 안내',
        info: "클래스 101+ 구독료가 올랐어요. 다양한 분야의 클래스를 내 방에서 수강할 수 있는 클래스101+를 이용해 주셔서 감사해요. 아쉽지만 제휴사 사정으로 5월부터 구독료가 900원 오를 예정이에요.2023년 5월 1일(월) 이전에 구독하는 고객님은 오르기 전 가격으로 계속 이용할 수 있습니다."
    },
    {
        id: 3,
        title: '픽앤픽 갤럭시 S22 3일 구독권 가격 인하 안내',
        info: "갤럭시 S22 3일권 구독료가 내렸어요 다양한 디바이스를 체험해 볼 수 있는 픽앤픽을 이용해 주셔서 감사해요.5월 9일부터 갤럭시 S22 3일 구독료가 8,500원 내릴 예정이에요.2023년 5월 1일(월) 부터 2023년 5월 8일(월)까지 구독하는 고객님도 인하된 가격으로 이용하실 수 있습니다."
    },
    {
        id: 4,
        title: '다그린 유아간식팩 제휴 종료 안내',
        info: "다그린 유아간식팩 할인 쿠폰 구독이 제휴사 사정으로 종료되었어요. 떡뻥, 옹알이 등 유기농 유아 간식을 저렴한 가격으로 구입할 수 있는 다그린 유아간식팩 할인 쿠폰을 이용해 주셔서 감사해요. 아쉽지만 제휴사 사정으로 4월28일을 마지막으로 제휴가 종료될 예정이에요.더 좋은 브랜드와 상품을 제공하는 유독이 될게요."
    },
    {
        id: 5,
        title: '닥터맘마 제휴 종료 안내',
        info: "닥터맘마 반려동물 사료 구독권 서비스가 제휴사 사정으로 인하여 아래와 같이 종료될 예정이오니 서비스 이용에 참고하여 주시기 바랍니다. ● 기존 이용고객은 3월 쿠폰까지 사용가능하며 4월 1일 이후 갱신되지 않도록 해지 예정입니다. LG유플러스는 앞으로도 더 좋은 서비스를 제공할 수 있도록 노력하겠습니다."
    },
    {
        id: 6,
        title: "‘다독’ 서비스 이용약관 외 2종(개인정보 처리 관련)약관 변경 안내",
        info: "고객님, 안녕하세요. 항상 ‘다독’을 이용 해 주셔서 감사합니다.2022년 11월 8일부터 타사 고객도 ‘다독’가입이 가능하게 되어 이용약관, 개인정보 수집 및 이용동의, 개인정보 제 3자 제공 동의 내용이 일부 변경됩니다. 아래 내용을 꼭 확인하여 ‘다독’ 이용에 참고하시길 바랍니다.위 내용이 반영 된 변경 된 이용약관은 11월 8일부터 홈페이지 하단 [이용약관]에서 확인할 수 있습니다. 앞으로도 저희 ‘다독’은 고객님께 더 좋은 서비스와 다양한 혜택을 제공할 수 있도록 항상 최선을 다하겠습니다. 감사합니다."
    },
    {
        id: 7,
        title: "‘다독’ 서비스 이용약관 및 개인정보 활용 동의 약관 변경 안내",
        info: "고객님, 안녕하세요. 항상 ‘유독’을 이용 해 주셔서 감사합니다.2022년 12월 20일부터 다독 서비스 이용약관, 개인정보 수집 및 이용 동의 내용이 일부 변경됩니다. 아래 내용을 꼭 확인하여 ‘다독’ 이용에 참고하시길 바랍니다.위 내용이 반영 된 변경 된 이용약관은 12월 20일부터 다독 홈페이지 하단 [이용약관]에서 확인할 수 있습니다. 앞으로도 저희 ‘다독’은 고객님께 더 좋은 서비스와 다양한 혜택을 제공할 수 있도록 항상 최선을 다하겠습니다.감사합니다."
    },
]

