const Questiondata = [
    {
        id : 1,
        category : "[가입]",
        title : "유독은 어떤 서비스 인가요?",
        info : "스트리밍부터 취향 맞춤 서비스까지 내 마음대로 고르고 할인까지 받는 다독 필요한 것만 모은 나를 위한 구독 서비스 입니다. OTT(온라인 동영상 서비스), 음악, 전자책은 물론 커피, 배달, 세탁, 쇼핑까지 내 일상에 필요한 다양한 서비스를 선택하여 모두 할인 받을 수 있습니다. 다독에서 원하는 구독 서비스 가입하고, 조회, 해지까지 편리하게 이용해 보세요."
    },
    {
        id : 2,
        category : "[가입]",
        title : "구독 서비스에 가입하려면 어떻게 해야 하나요?",
        info : "다독 홈페이지에 접속해 한 번에 5개까지 구독 서비스에 가입할 수 있습니다. (최대 7개까지 동시에 가입, 사용이 가능합니다.) 다독 홈페이지에 접속하여 이용하실 수 있습니다."
    },
    {
        id : 3,
        category : "[요금]",
        title : "구독 서비스에 가입한 날부터 요금이 청구되나요?",
        info : "서비스마다 다릅니다. 넷플릭스, 윌라 등 계정 연동이 필요한 구독 서비스는 연동한 날 부터 요금이 청구됩니다. 그 외 구독 서비스는 모두 가입한 날부터 요금이 청구됩니다."
    },
    {
        id : 4,
        category : "[해지]",
        title : "구독 서비스에 가입 후 사용한 적이 없으면 즉시 해지할 수 있나요?",
        info : "네. 가입일로부터 7일 안에 서비스를 사용한 적이 없으면 다독 고객센터 1833-1212(유료)로 문의하여 즉시 해지할 수 있습니다. 신청 후 사용이력이 없음이 확인되면 별도 요금이 청구되지 않습니다."
    },
    {
        id : 5,
        category : "[해지]",
        title : "가입한 구독 서비스는 어떻게 해지할 수 있나요?",
        info : "다독 홈페이지에 접속해 메뉴에서 MY구독에서 구독 해지를 누르면 구독서비스를 해지할 수 있습니다. 해지를 신청해도 다음 결제일 전날까지 서비스를 계속 이용할 수 있습니다."
    },
    {
        id : 6,
        category : "[변경]",
        title : "이용 중에 다른 구독 서비스를 추가로 가입할 수 있나요?",
        info : "네, 신규 구독 서비스는 언제든지 추가로 가입할 수 있습니다. (단, 최대 가입 가능 수량은 7개까지 입니다. 7개를 초과하는 경우 기존 서비스 해지 후 신규 서비스 가입이 가능합니다.)"
    },
    {
        id : 7,
        category : "[제휴사]",
        title : "서비스 이용 중에 문제가 발생하면 어떻게 해야 하나요?",
        info : "구독 서비스 가입과 해지는 다독 고객센터 1833-1212(유료), 서비스 이용 중 문제가 발생하면 제휴사 고객센터로 문의해주세요. 제휴사 고객센터 전화번호는 다독 홈페이지 접속해 메뉴 -> MY구독 -> 제휴사 상품명 선택 -> 자세히 보기를 누르시면 유의 사항에서 확인하실 수 있습니다",
    },
]

export default Questiondata;